astb_relise/src/InformationRegisters/УстановленныеНормыВыдачиСИЗ/УстановленныеНормыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеНормыВыдачиСИЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеНормы</name>
    <type>
      <types>CatalogRef.УсловияНорм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/УстановленныеНормыВыдачиСИЗ/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Параметры.Отбор.Организация));
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Должность") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Должность", Параметры.Отбор.Должность));
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("НормаВыдачи") Тогда
		ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("НормаВыдачи", Параметры.Отбор.НормаВыдачи));
	КонецЕсли;
	
КонецПроцедуры
